#if !defined _UHFREADER_API_H__
#define _UHFREADER_API_H__


typedef struct		//SRECORD
{
    UCHAR   Sindex;
    UCHAR   Slen;
    UCHAR   Target;
    UCHAR   Action;
    UCHAR   bank;
    UCHAR   Ptr[2];
    UCHAR   Len;
    UCHAR   Mask[32];
    UCHAR   Truncate;

}SRECORD;

typedef struct		//TRECORD
{
    int		Tindex;
    int		Len;
    UCHAR   UII[256];
}TRECORD;


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         通用 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************************************
 *
 *                                         Open port and connect
 *
 *********************************************************************************************************/
int WINAPI UhfReaderConnect (HANDLE &hCom, char* cPort, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *										   Disconnect and close port
 *
 *********************************************************************************************************/
int WINAPI UhfReaderDisconnect (HANDLE &hCom, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Open com port
 *
 *********************************************************************************************************/
int WINAPI UhfOpenPort (HANDLE &hCom, char* cPort, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Close com port
 *
 *********************************************************************************************************/
int WINAPI UhfClosePort (HANDLE &hCom);

/**********************************************************************************************************
 *
 *                                         Get RLM status
 *
 *********************************************************************************************************/
int WINAPI UhfGetPaStatus (HANDLE hCom, UCHAR* uStatus, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Get RLM power setting
 *
 *********************************************************************************************************/
int WINAPI UhfGetPower (HANDLE hCom, UCHAR* uPower, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Set RLM power
 *
 *********************************************************************************************************/
int WINAPI UhfSetPower (HANDLE hCom, UCHAR uOption, UCHAR uPower, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Get RLM frequency setting
 *
 *********************************************************************************************************/
int WINAPI UhfGetFrequency(HANDLE hCom, UCHAR* uFreMode, UCHAR* uFreBase, UCHAR* uBaseFre, UCHAR* uChannNum, UCHAR* uChannSpc, UCHAR* uFreHop, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Set RLM frequency
 *
 *********************************************************************************************************/
int WINAPI UhfSetFrequency(HANDLE hCom, UCHAR uFreMode, UCHAR uFreBase, UCHAR* uBaseFre, UCHAR uChannNum, UCHAR uChannSpc, UCHAR uFreHop, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Read Register
 *
 *********************************************************************************************************/
int WINAPI UhfGetRegister (HANDLE hCom, int RADD, int RLEN, UCHAR* STATUS, UCHAR* REG, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Write Register
 *
 *********************************************************************************************************/
int WINAPI UhfSetRegister (HANDLE hCom, int RADD, int RLEN, UCHAR* REG_DATA, UCHAR* STATUS, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Reset Register
 *
 *********************************************************************************************************/
int WINAPI UhfResetRegister (HANDLE hCom, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Save Register
 *
 *********************************************************************************************************/
int WINAPI UhfSaveRegister (HANDLE hCom, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Get Version
 *
 *********************************************************************************************************/
int WINAPI UhfGetVersion (HANDLE hCom, UCHAR* uSerial, UCHAR* uVersion, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Read RLM Uid
 *
 *********************************************************************************************************/
int WINAPI UhfGetReaderUID (HANDLE hCom, UCHAR* uUid, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Sleep
 *
 *********************************************************************************************************/
int WINAPI UhfEnterSleepMode (HANDLE hCom, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM stop get
 *
 *********************************************************************************************************/
int WINAPI UhfStopOperation (HANDLE hCom, UCHAR flagCrc);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         标签盘点 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************************************
 *
 *                                         RLM inventory
 *
 *********************************************************************************************************/
int WINAPI UhfStartInventory (HANDLE hCom, UCHAR flagAnti, UCHAR initQ, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Get received data
 *
 *********************************************************************************************************/
int WINAPI UhfReadInventory (HANDLE hCom, UCHAR* uLenUii, UCHAR* uUii);

/**********************************************************************************************************
 *
 *                                         RLM single inventory
 *
 *********************************************************************************************************/
int WINAPI UhfInventorySingleTag (HANDLE hCom, UCHAR* uLenUii, UCHAR* uUii , UCHAR flagCrc);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         标签数据存取 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************************************
 *
 *                                         RLM read data
 *
 *********************************************************************************************************/
int WINAPI UhfReadDataByEPC (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR* uUii, UCHAR* uReadData, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM  read data single
 *
 *********************************************************************************************************/
int WINAPI UhfReadDataFromSingleTag (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR* uReadData, UCHAR* uUii, UCHAR* uLenUii, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM read data for CNT is zero
 *
 *********************************************************************************************************/
int WINAPI UhfReadMaxDataByEPC (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR* uUii, UCHAR* Data_len, UCHAR* uReadData, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM  read data single for CNT is zero
 *
 *********************************************************************************************************/
int WINAPI UhfReadMaxDataFromSingleTag (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR* Data_len, UCHAR* uReadData, UCHAR* uUii, UCHAR* uLenUii, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM write data
 *
 *********************************************************************************************************/
int WINAPI UhfWriteDataByEPC (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR* uUii, UCHAR* uWriteData, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM write data single
 *
 *********************************************************************************************************/
int WINAPI UhfWriteDataToSingleTag (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR* uWriteData, UCHAR* uUii, UCHAR* uLenUii, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM write mutil-data
 *
 *********************************************************************************************************/
int WINAPI UhfBlockWriteDataByEPC (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR* uUii, UCHAR* uWriteData, UCHAR* uErrorCode, UCHAR* uStatus, UCHAR* uWritedLen, UCHAR* RuUii, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM write mutil-data single
 *
 *********************************************************************************************************/
int WINAPI UhfBlockWriteDataToSingleTag (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR* uWriteData, UCHAR* uUii, UCHAR* uLenUii, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR* uWritedLen, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM erase data
 *
 *********************************************************************************************************/
int WINAPI UhfEraseDataByEPC (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR* uUii, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM erase data single
 *
 *********************************************************************************************************/
int WINAPI UhfEraseDataFromSingleTag  (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR* uUii, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM lock memory
 *
 *********************************************************************************************************/
int WINAPI UhfLockMemByEPC (HANDLE hCom, UCHAR* uAccessPwd, UCHAR* uLockData, UCHAR* uUii, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM lock memory single
 *
 *********************************************************************************************************/
int WINAPI UhfLockMemFromSingleTag (HANDLE hCom, UCHAR* uAccessPwd, UCHAR* uLockData, UCHAR* uUii, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM kill tag
 *
 *********************************************************************************************************/
int WINAPI UhfKillTagByEPC (HANDLE hCom, UCHAR* uKillPwd, UCHAR* uUii, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM kill tag single
 *
 *********************************************************************************************************/
int WINAPI UhfKillSingleTag (HANDLE hCom, UCHAR* uKillPwd, UCHAR* uUii, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM  read data anti single
 *
 *********************************************************************************************************/
int WINAPI UhfStartReadDataFromMultiTag (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR uOption, UCHAR* uPayLoad, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM get read data anti single
 *
 *********************************************************************************************************/
int WINAPI UhfGetDataFromMultiTag (HANDLE hCom, UCHAR* uStatus, UCHAR* ufData_len, UCHAR* ufReadData, UCHAR* usData_len, UCHAR* usReadData, UCHAR* uUii, UCHAR* uLenUii);

/**********************************************************************************************************
 *
 *                                         RLM write EPC
 *
 *********************************************************************************************************/
int WINAPI UhfBlockWriteEPCByEPC (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uCnt, UCHAR* uUii, UCHAR* uWriteData, UCHAR* uErrorCode, UCHAR* uStatus, UCHAR* uWritedLen, UCHAR* RuUii, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM write EPC single
 *
 *********************************************************************************************************/
int WINAPI UhfBlockWriteEPCToSingleTag (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uCnt, UCHAR* uWriteData, UCHAR* uUii, UCHAR* uLenUii, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR* uWritedLen, UCHAR flagCrc);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         SELECT操作 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************************************
 *
 *                                         RLM Add select
 *
 *********************************************************************************************************/
int WINAPI UhfAddFilter (HANDLE hCom, SRECORD* pSRecord, UCHAR* STATUS, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Delete select
 *
 *********************************************************************************************************/
int WINAPI UhfDeleteFilterByIndex (HANDLE hCom, UCHAR SINDEX, UCHAR* STATUS, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Get select
 *
 *********************************************************************************************************/
int WINAPI UhfStartGetFilterByIndex (HANDLE hCom, UCHAR SINDEX, UCHAR SNUM, UCHAR* STATUS, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Get select received data
 *
 *********************************************************************************************************/
int WINAPI UhfReadFilterByIndex(HANDLE hCom, UCHAR* STATUS, SRECORD* pSRecord);

/**********************************************************************************************************
 *
 *                                         RLM Choose select
 *
 *********************************************************************************************************/
int WINAPI UhfSelectFilterByIndex (HANDLE hCom, UCHAR SINDEX, UCHAR SNUM, UCHAR* STATUS, UCHAR flagCrc);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         固件升级 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************************************
 *
 *                                         RLM BootLoader Start Update
 *
 *********************************************************************************************************/
int WINAPI UhfUpdateInit (HANDLE &hCom, char* cPort, UCHAR* STATUS, UCHAR* RN32, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM BootLoader Inverse
 *
 *********************************************************************************************************/
int WINAPI UhfUpdateSendRN32 (HANDLE hCom, UCHAR* RN32, UCHAR* STATUS, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM BootLoader Start trans
 *
 *********************************************************************************************************/
int WINAPI UhfUpdateSendSize (HANDLE hCom, UCHAR* STATUS, UCHAR* FILESIZE, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM BootLoader Start trans
 *
 *********************************************************************************************************/
int WINAPI UhfUpdateSendData (HANDLE hCom, UCHAR* STATUS, UCHAR PACKNUM, UCHAR LASTPACK, int Data_len, UCHAR* TRANDATA, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM BootLoader End Update
 *
 *********************************************************************************************************/
int WINAPI UhfUpdateCommit  (HANDLE hCom, UCHAR* STATUS, UCHAR flagCrc);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         SAM307 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************************************
 *
 *                                         RLM Set SAM
 *
 *********************************************************************************************************/
int WINAPI UhfSetSAM (HANDLE hCom, UCHAR* uInput, UCHAR uLen, UCHAR* uReData, int* uReLen, UCHAR* uSW1, UCHAR* uSW2, UCHAR* STATUS, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Get Info SAMtoSRA
 *
 *********************************************************************************************************/
int WINAPI UhfGetInfoSAMtoSRA (HANDLE hCom, UCHAR* uInput, UCHAR uLen, UCHAR* uSW1, UCHAR* uSW2, UCHAR* STATUS, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Get Info SAMtoSRB
 *
 *********************************************************************************************************/
int WINAPI UhfGetInfoSAMtoSRB (HANDLE hCom, UCHAR* uInput, UCHAR uLen, UCHAR* uSW1, UCHAR* uSW2, UCHAR* STATUS, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Get SR
 *
 *********************************************************************************************************/
int WINAPI UhfGetSR (HANDLE hCom, UCHAR uSR, UCHAR* uValue, UCHAR* uStatus, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Write SR to Tag By EPC
 *
 *********************************************************************************************************/
int WINAPI UhfWriteSRtoTagByEPC (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR* uUii, UCHAR uSR, UCHAR uAddr, UCHAR uLen, UCHAR* uErrorCode, UCHAR* uStatus, UCHAR* uWritedLen, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM Write SR to Tag Single
 *
 *********************************************************************************************************/
int WINAPI UhfWriteSRtoTagSingle (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR uSR, UCHAR uAddr, UCHAR uLen, UCHAR* uUii, UCHAR* uLenUii, UCHAR* uErrorCode, UCHAR* uStatus, UCHAR* uWritedLen, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Set PSAM power on or off
 *
 *********************************************************************************************************/
int WINAPI UhfSetPsamPowerOnOrOff (HANDLE hCom, UCHAR type, UCHAR value, UCHAR* atr, UCHAR* atrlen, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Select file
 *
 *********************************************************************************************************/
int WINAPI UhfSelectFile (HANDLE hCom, UCHAR flagCrc);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         RLM300CH4 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************************************
 *
 *                                         Set Multi Ant Function
 *
 *********************************************************************************************************/
int WINAPI UhfSetMultiANT (HANDLE hCom, UCHAR* AntStatus, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Get Multi Ant Function
 *
 *********************************************************************************************************/
int WINAPI UhfGetMultiANT (HANDLE hCom, UCHAR* AntStatus, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Get RLM ANTs
 *
 *********************************************************************************************************/
int WINAPI UhfCheckANT (HANDLE hCom, UCHAR* ANT, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Choose RLM ANT
 *
 *********************************************************************************************************/
int WINAPI UhfChooseANT (HANDLE hCom, UCHAR ANT, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         RLM inventory for Multi Ant
 *
 *********************************************************************************************************/
int WINAPI UhfStartInventoryForMultiAnt (HANDLE hCom, UCHAR flagAnti, UCHAR initQ, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Get received tag from Multi Ant
 *
 *********************************************************************************************************/
int WINAPI UhfReadInventoryFromMultiAnt (HANDLE hCom, UCHAR* ANT, UCHAR* uLenUii, UCHAR* uUii);

/**********************************************************************************************************
 *
 *                                         RLM  read data for Multi Ant
 *
 *********************************************************************************************************/
int WINAPI UhfStartReadDataForMultiAnt (HANDLE hCom, UCHAR* uAccessPwd, UCHAR uBank, UCHAR* uPtr, UCHAR uCnt, UCHAR uOption, UCHAR* uPayLoad, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Get received data from Multi Ant
 *
 *********************************************************************************************************/
int WINAPI UhfGetDataFromMultiAnt (HANDLE hCom, UCHAR* ANT, UCHAR* uStatus, UCHAR* ufData_len, UCHAR* ufReadData, UCHAR* usData_len, UCHAR* usReadData, UCHAR* uUii, UCHAR* uLenUii);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         Alien 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************************************
 *
 *                                         Load image with uii
 *
 *********************************************************************************************************/
int WINAPI UhfLoadImageByEPC(HANDLE hCom, UCHAR* uApwd, UCHAR* uTid, UCHAR* uAccessPwd, UCHAR* uKillPwd, UCHAR* uEpc, UCHAR* uUser, UCHAR* uUii, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Load image without uii
 *
 *********************************************************************************************************/
int WINAPI UhfLoadImageFromSingleTag(HANDLE hCom, UCHAR* uApwd, UCHAR* uTid, UCHAR* uAccessPwd, UCHAR* uKillPwd, UCHAR* uEpc, UCHAR* uUser, UCHAR* uLenUii, UCHAR* uUii, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Fast load image with uii
 *
 *********************************************************************************************************/
int WINAPI UhfFastLoadImageByEPC(HANDLE hCom, UCHAR* uApwd, UCHAR* uTid, UCHAR* uAccessPwd, UCHAR* uKillPwd, UCHAR* uEpc, UCHAR* uUii, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Fast load image without uii
 *
 *********************************************************************************************************/
int WINAPI UhfFastLoadImageFromSingleTag(HANDLE hCom, UCHAR* uApwd, UCHAR* uTid, UCHAR* uAccessPwd, UCHAR* uKillPwd, UCHAR* uEpc, UCHAR* uLenUii, UCHAR* uUii, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Block read lock with uii
 *
 *********************************************************************************************************/
int WINAPI UhfBlockReadLockByEPC(HANDLE hCom, UCHAR* uApwd, UCHAR uLockBits, UCHAR* uUii, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Block read lock without uii
 *
 *********************************************************************************************************/
int WINAPI UhfBlockReadLockFromSingleTag(HANDLE hCom, UCHAR* uApwd, UCHAR uLockBits, UCHAR* uLenUii, UCHAR* uUii, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Block read lock with uii
 *
 *********************************************************************************************************/
int WINAPI UhfBlockPermaLockByEPC(HANDLE hCom, UCHAR* uApwd, UCHAR uReadOrLock, UCHAR uBank, UCHAR uPtr, UCHAR uRange, UCHAR* uMask, UCHAR* uUii, UCHAR* uPermalock, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Block read lock without uii
 *
 *********************************************************************************************************/
int WINAPI UhfBlockPermaLockFromSingleTag(HANDLE hCom, UCHAR* uApwd, UCHAR uReadOrLock, UCHAR uBank, UCHAR uPtr, UCHAR uRange, UCHAR* uMask, UCHAR* uLenUii, UCHAR* uUii, UCHAR* uPermalock, UCHAR* uStatus, UCHAR* uErrorCode, UCHAR flagCrc);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         密钥注入器 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**********************************************************************************************************
 *
 *                                         RLM begin to set key for yankaqi 
 *
 *********************************************************************************************************/
int WINAPI UhfBeginSetKey (HANDLE hCom);

/**********************************************************************************************************
 *
 *                                         RLM set key for yankaqi
 *
 *********************************************************************************************************/
int WINAPI UhfSetKey (HANDLE hCom, UCHAR* key);

/**********************************************************************************************************
 *
 *                                         RLM end setting key for yankaqi
 *
 *********************************************************************************************************/
int WINAPI UhfEndSetKey (HANDLE hCom);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//                                         其他 命令集
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************************************
 *
 *										   Com Transparent Transfer
 *
 *********************************************************************************************************/   
int WINAPI UhfSetTransparentTransfer (HANDLE hCom, UCHAR flagSet, UCHAR* uStatus, UCHAR flagCrc);

/**********************************************************************************************************
 *
 *                                         Create lock code
 *
 *********************************************************************************************************/
void WINAPI LockGenCode(UCHAR bkill, UCHAR baccess, UCHAR buii, UCHAR btid, UCHAR buser, UCHAR* LockCode);

/**********************************************************************************************************
 *
 *                                         Search HIDs
 *
 *********************************************************************************************************/
int WINAPI UhfSearchHids (char* serials);

/**********************************************************************************************************
 *
 *                                         char convert to CString
 *
 *********************************************************************************************************/
void WINAPI UhfCharToCString(UCHAR *chaInput, char *cstrOutput, int len);

/**********************************************************************************************************
 *
 *                                         CString convert to char
 *
 *********************************************************************************************************/
void WINAPI UhfCStringToChar(CString &cstrInput, UCHAR *chaOutput, int len);

#endif